Dlubal.RFEM5.Member
Member parameters

Dlubal.RFEM5.Member.No
Number

Dlubal.RFEM5.Member.ID
Identifier

Dlubal.RFEM5.Member.Comment
Comment

Dlubal.RFEM5.Member.Tag
Tag

Dlubal.RFEM5.Member.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Member.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.Member.LineNo
Line number used for member

Dlubal.RFEM5.Member.Type
Member Type

Dlubal.RFEM5.Member.Rotation
Member rotation

Dlubal.RFEM5.Member.StartCrossSectionNo
Cross-section number on the member start

Dlubal.RFEM5.Member.EndCrossSectionNo
Cross-section number on the member end

Dlubal.RFEM5.Member.TaperShape
Taper shape

Dlubal.RFEM5.Member.StartHingeNo
Hinge number on the member start

Dlubal.RFEM5.Member.EndHingeNo
Hinge number on the member end

Dlubal.RFEM5.Member.EccentricityNo
Member eccentricity number

Dlubal.RFEM5.Member.DivisionNo
Member division number

Dlubal.RFEM5.Member.FoundationNo
Member elastic foundation number (read only)

Dlubal.RFEM5.Member.NonlinearityNo
Member nonlinearity number (read only)

Dlubal.RFEM5.Member.RibNo
Rib No. (read only)

Dlubal.RFEM5.Member.Length
Member length L (read only)

Dlubal.RFEM5.Member.Weight
Member weight W (read only)